import { isWebp } from './modules'
import { windowAuth } from './modules/windowAuth'
import { textareaHeightAuto } from './helpers/textareaHeightAuto'
import { authenticate } from './modules/authenticate'
/* Раскомментировать для использования */
// import { MousePRLX } from './libs/parallaxMouse'

/* Раскомментировать для использования */
// import Swiper, { Navigation, Pagination } from 'swiper'

// Проверка браузера на поддерку .webp изображений ====================================================================================================================================================
isWebp()
// ====================================================================================================================================================

// Паралакс мышей ====================================================================================================================================================
// const mousePrlx = new MousePRLX({})
// ====================================================================================================================================================

// Фиксированный header ====================================================================================================================================================
// headerFixed()
// ====================================================================================================================================================
windowAuth()
textareaHeightAuto('#new-post', 44)

let isAuth = location.pathname !== '/'

authenticate(isAuth)